<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Google Drive and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.bbc-source.munki.GoogleDrive</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>GoogleDrive</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Google Drive Helper (GPU).app</string>
				<string>Google Drive Helper.app</string>
				<string>Google Drive.app</string>
				<string>Google Drive Helper (Plugin).app</string>
				<string>FinderHelper.app</string>
				<string>Google Drive Helper (Renderer).app</string>
				<string>Google Docs.app</string>
				<string>Google Sheets.app</string>
				<string>Google Slides.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>production</string>
			</array>
			<key>description</key>
			<string> </string>
			<key>developer</key>
			<string>Google</string>
			<key>display_name</key>
			<string>Google Drive</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
		<key>pkg_ids_set_optional_true</key>
        <array>
            <string>com.google.drivefs.filesystems.dfsfuse.arm64</string>
            <string>com.google.drivefs.filesystems.dfsfuse.x86_64</string>
            <string>com.google.drivefs.arm64</string>
            <string>com.google.drivefs.x86_64</string>
        </array>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.bbc-source.download.GoogleDrive</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>minimum_os_version</key>
                    <string>%min_os_version%</string>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.BBC-source.autopkg.Processor/MunkiPkginfoReceiptsEditor</string>
        </dict>
	</array>
</dict>
</plist>
